show databases;
use studydb;


create table book_list (
book_no  varchar(16) not null,
book_name varchar(50),
writer  varchar(30),
publisher varchar(30),
reg_date  date,
price  int
);


INSERT INTO book_list VALUES 
('9791168473690','세이노의 가르침','세이노','데이원','2023-03-02',7200),
('9791158741952','상처받지 않는 관계의 비밀','최리나','미디어숲','2023-07-30',18800),
('9788901272580','역행자','자청','웅진지식하우스','2023-05-29',19500),
('9788932923413','꿀벌의 예언1','베르나르 베르베르','열린책들','2023-06-21',16800),
('9791191891287','메리골드 마음 세탁소','윤정은','북로망스','2023-03-06',15000),
('9791191669466','나는 죽을 때까지 지적이고 싶다','양원근','정민미디어','2023-06-15',16800),
('9791158741953','심플 라이프','제시카 로즈 윌리엄스','밀리언서재','2023-06-15',17500),
('9791190299770','모든 삶은 흐른다','로랑스 드빌레르','피카(FIKA)','2023-04-03',16800),
('9791192389073','유연함의 힘','수잔 애쉬포드','상상스퀘어','2023-05-10',19800),
('9791167740984','도둑맞은 집중력','요한 하리','어크로스','2023-04-28',18800);


select * from book_list;